#22มกราคม2564
""" #โปรแกรมคิดค่าผ่านทาง
print("เลือกเมนูเพื่อทำรายการ")
print("#############################")
print("กด 1 เลือกแบบเหมาจ่าย")
print("กด 2 เลือกแบบจ่ายเพิ่ม")

manu= int(input("เลือก : "))

if manu == 1 : #แบบจ่ายเพิ่ม
    high= int(input("กรุณากรอกระยะทาง : "))
    if high<=25 :
        print("ค่าใช้จ่ายรวม 25 บาท") #ระยะทางไม่เกิน25กิโลเมตร
    else :
        print("ค่าใช้จ่ายรวม 55 บาท") #ระยะทางเกิน25กิโลเมตร
elif manu == 2 : 
    high= int(input("กรุณากรอกระยะทาง : "))
    if high < 25 :
        print("ค่าใช้จ่ายรวม 25 บาท") #ระยะทางไม่เกิน25กิโลเมตร
    else :
        print("ค่าใช้จ่ายรวม", int(25+55), "บาท") #ระยะทางเกิน25กิโลเมตร #แรกเข้า+คิดเพิ่มเกิน25 กม.
else :
    print("Error")


#โปรแกรมหาผลรวม
i=1
sum=0
loop = int(input("กรุณากรอกจำนวนครั้งในการรับค่า  : "))
while( i <= loop ) : 
    a = int(input("กรอกตัวเลข : "))
    sum+=a
    i+=1
print("ผลรวมทั้งหมด = ", sum)

print("ป้อนชื่ออาหารสุดโปรด หรือ exit เพื่ออกจากโปรแกรม")
foodlist = []
i=1
y=0
while(i<100):
    food = str(input("อาหารโปรดอันดับที่ "+str(i)+" : "))
    if (food == 'exit') :
        break
    foodlist.append(food)
    i+=1
print("อาหารสุดโปรดของคุณคือ")
for x in foodlist :
    y+=1
    print(str(y)+"."+str(x), end ='      ')
"""

a = []
while True :
    b = input('----ร้านคุณหลินบิวตี้----\n เพิ่ม\t\t[a]\n แสดง\t\t[s]\n ออกจากระบบ\t[x]\n')
    b = b.lower()
    if b == 'a' : 
        c = input('ป้อนรายชื่อลูกค้า(รหัส : ชื่อ : จังหวัด)')
        a.append(c)
        print('\n*******ข้อมูลได้เข้าสู่ระบบแล้ว*******\n')
    elif b == 's' : 
        print('{0:-<30}'.format(""))
        print('{0:-<10}{1:-<15}{2:15}'.format('รหัส','ชื่อ','จังหวัด'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in a : 
            e = d.split(":")
            print('{0[0]:<6} {0[1]:<10}({0[2]:<10})'.format(e))
            continue
    elif b == 'x' : 
        break
print('ทำคำสั่งถัดไป')