print("โปรแกรมคำนวนค่าผ่านทางมอเตอร์เวย์")
print("-------------------------------")
print("รถยนต์ 4 ล้อ           กด 1")
print("รถยนต์ 6 ล้อ           กด 2")
print("รถยนต์มากกว่า 6 ล้อ     กด 3\n")

thisdict1 = {
    "ลาดกระบัง-บางบ่อ" : "25 บาท",
    "ลาดกระบัง-บางประกง" : "30 บาท",
    "ลาดกระบัง-พนัสนิคม" : "45 บาท",
    "ลาดกระบัง-บ้านบึง" : "55 บาท",
    "ลาดกระบัง-บางพระ" : "60 บาท",
}
thisdict2 = {
    "ลาดกระบัง-บางบ่อ" : "45 บาท",
    "ลาดกระบัง-บางประกง" : "45 บาท",
    "ลาดกระบัง-พนัสนิคม" : "75 บาท",
    "ลาดกระบัง-บ้านบึง" : "90 บาท",
    "ลาดกระบัง-บางพระ" : "100 บาท",
}
thisdict3 = {
    "ลาดกระบัง-บางบ่อ" : "60 บาท",
    "ลาดกระบัง-บางประกง" : "70 บาท",
    "ลาดกระบัง-พนัสนิคม" : "110 บาท",
    "ลาดกระบัง-บ้านบึง" : "130 บาท",
    "ลาดกระบัง-บางพระ" : "140 บาท",
}

car = int(input("เลือกประเภทยานพาหนะ "))

if car==1:
    print("ค่าบริการรถยนต์ 4 ล้อ\n")
    print(*thisdict1.items(), sep = "\n")
if car==2:
    print("ค่าบริการรถยนต์ 6 ล้อ\n")
    print(*thisdict2.items(), sep = "\n")
if car==3:
    print("ค่าบริการรถยนต์มากกว่า 6 ล้อ\n")
    print(*thisdict3.items(), sep = "\n")
