 #โปรแกรมคิดค่าผ่านทาง
print("เลือกเมนูเพื่อทำรายการ")
print("#############################")
print("กด 1 เลือกแบบเหมาจ่าย")
print("กด 2 เลือกแบบจ่ายเพิ่ม")

manu= int(input("เลือก : "))

if manu == 1 : #แบบจ่ายเพิ่ม
    high= int(input("กรุณากรอกระยะทาง : "))
    if high<=25 :
        print("ค่าใช้จ่ายรวม 25 บาท") #ระยะทางไม่เกิน25กิโลเมตร
    else :
        print("ค่าใช้จ่ายรวม 55 บาท") #ระยะทางเกิน25กิโลเมตร
elif manu == 2 : 
    high= int(input("กรุณากรอกระยะทาง : "))
    if high < 25 :
        print("ค่าใช้จ่ายรวม 25 บาท") #ระยะทางไม่เกิน25กิโลเมตร
    else :
        print("ค่าใช้จ่ายรวม", int(25+55), "บาท") #ระยะทางเกิน25กิโลเมตร #แรกเข้า+คิดเพิ่มเกิน25 กม.
else :
    print("Error")